Repository: dmarov/portfolio-src
Catalog: src/locale/translation.*.xlf
Languages: ru_ru

# EDUCATION_PAGE_HEADER
source: Education
ru_ru: Образование

# EDUCATION_ABOUT
source: Before beginning of my career as a software developer I've got solid math and computer science background in <b>NARFU "Applied Mathematics and Computer Science"</b>. At that time I participated in math and programming olympiads. As my base programming language I regarded <b>C++</b> but also I learned and worked with C, Java, Python, Assembly. I've graduated in 2017.
ru_ru: Перед тем как начать свою карьеру разработчика я получил высшее образование по специальности <b>"Прикладная математика и информатика"</b> в САФУ. В то время я активно учавствовал в олимпиадах по программированию. Своим основным языком программирования я считал <b>C++</b> но, также, изучал другие языки, такие как C, Java, Python, Assembly. Я закончил университет в 2017.

# HOME_PAGE_LINK
source: Home
ru_ru: Главная

# PRODUCTS_PAGE_LINK
source: Products
ru_ru: Продукты

# ABOUT_ME_PAGE_LINK
source: About Me
ru_ru: Обо мне

# CAREER_PAGE_HEADER
source: Career
ru_ru: Карьера

# CAREER_BEGINNING_COMMERCIAL
source: I've started my career as a backend developer in 2017. It was my first experience of commercial software development and that's when I got acquainted with <b>PHP</b> and <b>MySQL</b>. At the same time I took a grasp on frontend technologies such as <b>Gulp</b>, <b>Webpack</b>, <b>Sass</b>, <b>Babel</b>.
ru_ru: Я начал свою карьеру в качестве бэкэнд разработчика в 2017 году. Это был мой первый опыт коммерческой разработки программного обеспечения и тогда я ознакомился с <b>PHP</b> и <b>MySQL</b>, а так же с фронтэнд технологиями, такими как <b>Gulp</b>, <b>Webpack</b>, <b>Sass</b>, <b>Babel</b>.

# CARRIER_FRONTEND_FRAMEWORK
source: The time has come when native Javascript was not enough in order to keep implementing complex solutions in efficient way. That's when I made decision to learn <b>Vue</b> framework which payed out later.
ru_ru: Вскоре настало время когда одного Javascript стало не достаточно для того чтобы реализовывать сложные решения эффективным способом. Тогда я принял решение изучить фреймворк <b>Vue</b>, что оправдало себя позже.

# CAREER_INFRASTRUCTURE
source: Path lead to resolve more complex problems related to outdated and unmaintainable infrastructure. Being experienced with <b>Node.js</b> In order to resolve some of existed problems I've implemented microservices. There are some of them:
ru_ru: Дальнейшее развитие приводило к необходимости решать более сложные проблемы, относящиеся к монолитной легаси инфраструктуре, которую было сложно поддерживать. Имея опыт использования <b>Node.js</b> для решения существующих проблем я реализовывал микросервисы. Вот некоторые из них:

# CAREER_MICRO_SERVICES
source: <li><b>SMS sending gateway</b> - REST API to send SMS notifications using GSM gateway </li><li><b>PDF generator</b> - REST API to convert HTML page to PDF (useful for printing invoices, and not just that) </li><li><b>JWT token generator</b> - REST API to generate JWT token pairs (useful for authorization) </li>
ru_ru: <li><b>шлюз для отправки SMS</b> - REST API для отправки SMS сообщений с использованием GSM модема </li><li><b>PDF генератор</b> - REST API для конвертации HTML страницы в PDF (полезно для печати инвойсов и не только) </li><li><b>JWT генератор</b> - REST API для генерации пар JWT токенов (используются для авторизации) </li>

# CAREER_SERVICES_USEFUL
source: These services were very useful for each new website.
ru_ru: Эти сервисы были полезны и использовались при последующей разработке веб-сайтов.

# CAREER_ADMINISTERING
source: Since each service required separate environnment it required a lot of administering efforts, which I was also responsible for. I already had a lot knowledge about <b>FreeBSD</b> operating system, so it was time to apply this knowledge in practice.
ru_ru: Так как каждый сервис требовал изолированного окружения, то администрирование требовало значительных затрат и усилий. Администрирование также было моей обязанностью. У меня уже было достаточно знаний об операционной системе <b>FreeBSD</b>, поэтому настало время чтобы применить эти знания на практике.

# CAREER_FRONTEND
source: Then I decided to specialize in frontend and move to bigger projects. That's when I've learned <b>Typescript</b> and <b>Angular</b> which became part of my main technology stack till current day. Such aspects as Search Engine Optimization (SEO), implementing end-to-end tests, pixel perfect markup, cross browser development, accessibility - this is what I'm most focused on at work.
ru_ru: Затем я решил специализироваться на фронтэнде и перейти на крупные проекты. Тогда я изучил <b>Typescript</b> и <b>Angular</b> которые стали частью моего основного технологического стека до настоящего времени. Такие аспекты как оптимизация для поисковых движков (SEO), реализация end-to-end тестов, вёрстка с точностью до пикселя (pixel perfect), кросс-браузерная разработка, досупность (accessibility) - на этом я сосредоточен во время работы.

# WHAT_I_STAND_FOR_PAGE_HEADER
source: What I stand for
ru_ru: Что я отстаиваю

# WHAT_I_STAND_FOR_ABOUT
source: At present I realize that I've experienced a lot and can formulate what kind of developer I am:
ru_ru: В настоящее время я понимаю, что накопил огромный опыт и могу сформулировать каким именно разработчиком я являюсь:

# PRINCIPLE_CODE_REFACTORING
source: I am huge advocate for code quality in long term products, because it allows to reduce future work as well for other developers and reduces amount of potential bugs
ru_ru: Я сторонник качества кода в долгосрочных продуктах, потому что это позволяет снизить количество работы в будущем в том числе и для других разработчиков, а так же снижает количество потенциальных багов

# PRINCIPLE_CODE_FORMATTING
source: I am huge advocate for uniform code formatting, because it reduces distractions and helps to focus on application architecture
ru_ru: Я сторонник унифицированного форматирования кода, потому что отличия отвлекают от того что действительно важно - архитектуры приложения

# PRINCIPLE_ASKING_QUESTIONS
source: I consider that ability to ask correct questions is the most valuable skill a developer can have
ru_ru: Я считаю, что умение задавать правильные вопросы это самый ценный скилл, который может быть у разработчика

# PRINCIPLE_ARGUMENTATION
source: I consider that every significant consideration should have valid argumentation in order to be legit
ru_ru: Я считаю, что любой тезис, который влияет на что-либо важное должен сопровождаться аргументацией

# PRINCIPLE_ACTIONS_BASE
source: I consider that actions of software developer should be based on principles
ru_ru: Я считаю, что действия разработчика должны быть основаны на принципах

# PRINCIPLE_REFACTORING
source: I consider that refactoring should be regarded as a part of a task rather than a a separate process
ru_ru: Я считаю, что рефакторинг следует считать частью задачи, а не отдельным процессом

# PRINCIPLE_SPECIALIZATION
source: I consider that developer should not be locked into narrow specialization, but have opportunities to learn adjacent domains from colleagues
ru_ru: Я считаю, что разработчик не должен быть изолирован в своей специализации, но иметь возможность принимать участие в смежных областях и учиться у своих коллег

# PRINCIPLE_CODE_INTEGRATION
source: I am huge advocate for fast code integration such as "trunk based flow", because it reduces bugs due to complicated conflicts for a coast of releasing incomplete features
ru_ru: Я сторонник быстрой интеграции кода, такой как "trunk based flow", потому что это помогает предотвратить баги, появляющиеся из-за решения сложных конфликтов ценой выкатывания не полностью готовых фич

# PRINCIPLE_BUGS_PRIORITY
source: I consider that fixing bugs should be topmost priority, because released feature is done when it's working, and it's working when it has no bugs
ru_ru: Я считаю, что исправление багов должно быть приоритетом №1, потому что выпущенная фича завершена тогда, когда она работает, а работает она тогда, когда в ней нет багов

# PRINCIPLE_AGILE
source: I consider that Agile is the best framework for software development process so far, mainly because it allows to provide fast feedback. Agile is not a solution for every problem and has disadvantages, but I think that advantages outweight disadvantages considerably
ru_ru: Я считаю, что Agile - наилучший фреймворк для процесса разработки програмного обеспечения который есть до сих пор, в основном потому, что позволяет предоставлять быстрый фидбэк. Agile - это не решение всех проблем и в нём есть недостатки, но я считаю, что достоинства перевешивают недостатки в значительной степени

# PRINCIPLE_BDD
source: I consider that long term product should be developed using <b>BDD</b> (Behavior Driven Development) process. Writing test after the fact results in poor test quality and poor code design. <b>TDD</b> (Test Driven Development) is a good approach as well but it has gone completely wrong in a sense of what for developer should write a test. BDD is the best approach I've experienced so far. I don't think it is necessary to follow BDD principles in order to get good software design, but it's very handy to have extra verification for correctness of behavior
ru_ru: Я считаю, что долгосрочные продукты следует разрабатывать с использованием <b>BDD</b> (Behavior Driven Development) принципов. Написание тестов после написания реализации приводит к низкому качеству тестов и низкому качеству реализации. <b>TDD</b> (Test Driven Development) тоже хороший подход, но он заблуждаетcя в том, для чего разработчик должен начать писать тест. BDD - лучший подход из тех что я имел опыт использовать. Я не считаю что следование BDD принципам необходимо, чтобы получить дизайн кода высокого качества, но очень полезно иметь дополнительное подтверждение корректности поведения

# PRINCIPLE_NAMING
source: I agree that <i> "There are only two hard things in Computer Science: cache invalidation and naming things." </i>
ru_ru: Я согласен что <i> "В компьютерных науках есть только две сложные проблемы – аннулирование кэша и придумывание названий" </i>

# BANNER_WELCOME
source: Welcome!
ru_ru: Добро пожаловать!

# BANNER_INTRODUCTION
source: My name is Dmitry, and this is my portfolio.
ru_ru: Меня зовут Дмитрий, и это моё портфолио.

# BANNER_WHO_AM_I
source: I am software developer with over {{ years }} {years, plural, =0{years} one{year} other{years}} of experience in web development.
ru_ru: Я разработчик с более чем {{ years }} {years, plural, =0{years} one{year} other{years}} опыта веб разработки.

source: {VAR_PLURAL, plural, =0 {years} one {year} other {years}}
ru_ru: {VAR_PLURAL, plural, =0 {лет} one {годом} few {годом} other {годами}}

# BANNER_MY_GOALS
source: I'm interested in technology and how to use it to make life better.
ru_ru: Мне интересны технологии и как их использовать чтобы сделать жизнь лучше.

source: My Technology Stack
ru_ru: Мой технологический стек

source: Products
ru_ru: Продукты

source: more products
ru_ru: все продукты

# PAGE_DOES_NOT_EXIST
source: This page doesn't exist
ru_ru: Этой страницы не существует

source: Return to Home page
ru_ru: Вернуться на главную страницу

# PROJECT_KEMEROVO_TITLE
source: Kemerovo Website
ru_ru: Вебсайт "Кемерово"

# PROJECT_RIVERTV_IS
source: RiverTV is a video streaming service provided by RiverTV Inc. from Canada.
ru_ru: RiverTV - это стриминговый сервис, предоставляемый RiverTV Inc. в Канаде.

# PROJECT_RIVERTV_DOES
source: RiverTV offers streaming of live channels and on-demand content. The website is an online shop and streaming web app where RiverTV package and addons can be acquired, managed and watched.
ru_ru: RiverTV предоставляет стриминг лайв каналов и on-demand контент. Вебсайт это онлайн магазин и приложение для стриминга где пакет RiverTV и аддоны можно приобрести, управлять ими и смотреть.

# PROJECT_RIVERTV_MY_RESPONSIBILITIES
source: I developed frontend part.
ru_ru: Я разрабатывал фронтэнд часть.

source: Robots
ru_ru: Роботы

# MANGO_OFFICE_IS
source: "Mango Telecom" is a provider for B2B solution in realm of telecommuniactions from Moscow, Russian Federation.
ru_ru: "Mango Telecom" это провайдер B2B решений в области телекоммуникаций из Москвы, Российская Федерация.

# VIRTUAL_ASSISTANT_IS
source: It has large ecosystem of products called "MANGO OFFICE". One of the products is "Virtual Assistant" service. It provides solution for creating and managing virtual employees also known as "robots".
ru_ru: Компания имеет огромную экосистему продуктов под названием "MANGO OFFICE". Один из продуктов - "Виртуальный помощник". Он позволяет создавать и управлять виртуальными операторами, так же называемыми "роботами".

# VIRTUAL_ASSISTANT_PURPOSE
source: "Robot" can make outcoming calls through an entire clients base, accept incoming calls, handle chat for all the different platforms such as "Telegram" or "Whatsapp".
ru_ru: "Робот" может делать исходящие звонки по всей пользовательской базе клиента, принимать входящие звонки, вести чат на различных платформах, таких как "Телеграм" или "Whatsapp".

# VIRTUAL_ASSISTANT_SCRIPT_CONSTRUCTOR
source: Script constructor enables major possibilities for scripting with conditions, cycles, SMS and email notifications, handling user input and lots of other features used to automate routine.
ru_ru: Конструктор скриптов предоставляет широкий инструментарий для создания сценариев с ветвлениями, циклами, отправкой SMS и email уведомлений, обработкой пользовательского ввода и множеством других действий, используемых для автоматизации рутинных процессов.

# PROJECT_ROBOTS_MY_RESPONSIBILITIES
source: I developed frontend.
ru_ru: Я разрабатывал фронтэнд часть.

# PROJECT_SNM_TITLE
source: "Scarlett & Monarch" CMS
ru_ru: CMS "Скарлетт и Монарх"

source: Technologies I used:
ru_ru: Технологии которые я использовал:

# PROJECT_MY_PORTFOLIO_TITLE
source: My Portfolio Website
ru_ru: Вебсайт моего портфолио

# PROJECT_MY_PORTFOLIO_IS
source: Dmitry Marov is an awesome software developer from Russian Federation. He decided that it is a good idea to make such website, which will display all the awesome projects he was involved in during his career.
ru_ru: Дмитрий Маров - замечательный разработчик из Российской Федерации. Он решил что было бы неплохо сделать такой вебсайт, на котором будут представлены все те крутые продукты, над которыми от трудился на протяжении своей карьеры.

# PROJECT_MY_PORTFOLIO_DOES
source: He hopes that this website will provide all the information in which potential employer might be interested in.
ru_ru: Он надеется, что этот вебсайт предоставит всю необходимую информацию, в которой потенциальный работодатель может быть заинтересован.

# PROJECT_MY_PORTFOLIO_SOURCE_CODE
source: Source code for this project can be viewed in <a href="https://github.com/dmarov/portfolio-src" target="_blank" (click)="onRepoVisitClick()" > project repository </a> .
ru_ru: Исходный код этого проекта можно посмтореть в<a href="https://github.com/dmarov/portfolio-src" target="_blank"> репозитории проекта </a>.

# PROJECT_PAXUS_TITLE
source: Paxus Website
ru_ru: Вебсайт Paxus

source: Visit
ru_ru: Посетить

# PROJECT_VMEDIA_IS
source: VMedia is an internet service provider from Canada.
ru_ru: VMedia это провайдер интернета в Канаде.

# PROJECT_VMEDIA_DOES
source: Apart from internet it also offers services such as cable-free TV, home phone and home security. The website is online shop where such services can acquired and managed.
ru_ru: Кроме интернета также предоставляет сервисы такие как безпроводное TV, домашняя телефония и системы охраны дома. Вебсайт представляет собой онлайн магазин где эти сервисы можно купить и управлять ими.

# PROJECT_VMEDIA_MY_RESPONSIBILITIES
source: I refactored frontend, implemented new features, fixed bugs, upgraded a lot of legacy code.
ru_ru: Я рефакторил фронтэнд код, реализовывал новые фичи, исправлял баги, обновлял легаси код.

# PROJECT_SNM_DOES
source: "Scarlett & Monarch" is a company of commercial website development and hosting. Content management sytem of "Scarlett & Monarch" is used for each and every website project of company. Each customer has their own requirements. CMS evolved with each new requirement.
ru_ru: "Скарлетт и Монарх" это компания по коммерческой веб разработке и хостингу. Система управления контентом "Скарлетт и монарх" используется для каждого веб сайта компании. Каждый заказчик имеет свои требования. Система управления контентом эволюционировала с каждым новым требованием.

# PROJECT_SNM_MY_RESPONSIBILITIES
source: I developed backend and frontend, updated legacy code, developed new modules such as <i>catalog editor</i>, <i>feedback</i>, <i>orders management</i>.
ru_ru: Я разрабатывал бэкенд и фронтэнд, обновлял легаси код, разрабатывал новые модули, такие как <i>редактор каталога</i>, <i>обратная связь</i>, <i>управление заказами</i>.

# PROJECT_SNM_ABOUT
source: One of the most advanced modules is <i>catalog editor</i>, which allows binding arbitrary properties to product. It allows bind arbitrary properties such as array of products, array of images, text, number, boolean, array of strings or even arbitrary structure if all the previous was not enough. API of web site allows to create advanced search by this properties. Orders module allows to create flexible orders, which change its' structure with every new project. Order has standard properties such as full name and phone number, but also can have any other property which will be displayed and can be modified. This module also allows to modify orders' content, adding, removing and modifying products. Orders' sum recalculates automatically, including discounts. It also allows to notify client via SMS or email about order status.
ru_ru: Один из самых продвинутых модулей это <i>редактор каталога</i>, который позволяет привязать произвольные свойства к продукту, такие как массив продуктов, массив картинок, текст, числа, булев тип, массив строк или даже произвольную структуру если ни один из предыдущих вариантов не подошёл. API веб сайта позволяет проводить умный поиск по этим свойствам. Модуль обработки заказов позволяет создавать заказы с гибкой структурой, которые меняют свою структуру с каждым новым проектом. У заказа есть стандартные свойства, такие как имя и номер телефона клиента, но также может иметь другие свойства которые будут отображены с возможностью редактирования. Этот модуль также позволяет редактировать содержимое заказов, добавлять, удалять и модифицировать товары. Сумма заказа пересчитывается автоматически с учётом скидок. Также модуль позволяет уведомить клиента о статусе заказа по SMS или через email.

# PROJECT_TRIK_TITLE
source: Trik Website
ru_ru: Вебсайт "Трик"

# PROJECT_TRIK_IS
source: Trik is a pharmacy network from Krasnodar, Russian Federation. The website is an online shop + CMS.
ru_ru: "Трик" это сеть аптек из Краснодара, Российская Федерация. Вебсайт представляет собой онлайн магазин + CMS.

# PROJECT_TRIK_DOES
source: Trik needed web store that would serve their 5 pharmacies. It required to create custom logic for catalog, cart and orders. Their site has complicated search by dynamically assignable properties tags, and any logical expression which can be constructed from any of properties or tags. Search result can be filtered by dynamically assignable properties.
ru_ru: Сети "Трик" нужен был онлайн магазин, который обслуживал бы 5 аптек компании. Это требовало создания кастомной логики каталога, корзины и заказов. Их сайт позволяет совершать умный поиск по динамически назначаемым свойствам, тегам, и любому логическому выражинию которое может быть составлено из свойств и тегов. Результаты поиска могут быть отфильтрованы по динамически назначаемым свойствам.

# PROJECT_TRIK_MY_RESPONSIBILITIES
source: I developed backend and frontend.
ru_ru: Я разрабатывал бэкенд и фронтэнд.

# PROJECT_VMEDIA_TITLE
source: VMedia Website
ru_ru: Вебсайт VMedia

# PROJECT_PAXUS_IS
source: Paxus is a company from Archangelsk, Russian Federation. It constructs and sells offroad vehicles, which can be customized depending on customer's needs. The website is an online shop + CMS.
ru_ru: Paxus это компания из Архангельска, Российская федерация. Создаёт и продаёт вездеходы и другие транспортные средства для внедорожья, которые могут быть кастомизированы в зависимости от требований покупателя. Вебсайт это онлайн магазин + CMS.

# PROJECT_PAXUS_DOES
source: Catalog includes product constructor where customer can customize vehicle parts such as engine, color, features, etc. Available customization for product can be assigned in CMS.
ru_ru: Каталог включает в себя редактор товара в котором покупатель может кастомизировать части транспрортного средства, такие как двигатель, цвет, дополнения, и.т.д. Допустимая кастомизация продукта может быть назначена в CMS.

# PROJECT_PAXUS_MY_RESPONSIBILITIES
source: I developed backend and Implemented most complex parts of frontend logic.
ru_ru: Я разрабатывал бэкенд и реализовывал наиболее сложную часть фронтэнд логики.

# PROJECT_RIVERTV_TITLE
source: RiverTV Website
ru_ru: Вебсайт RiverTV

# PROJECT_KEMEROVO_IS
source: Administration of Kemerovo, Russian Federation, ordered a web site to post relevent information related to business of Kemerovo city. The website has news lines, search, feedback and CMS to manage it all.
ru_ru: Администрация Кемерово, Российская Федерация, заказали вебсайт для публикования релевантной информации относящейся к бизнесу в Кемерово. Вебсайт состоит из лент новостей, поиска, обратной связи и CMS чтобы управлять всем этим.

# PROJECT_KEMEROVO_MY_RESPONSIBILITIES
source: I developed backend.
ru_ru: Я разрабатывал бэк-енд.
